In [38]:
import pandas as pd

In [41]:
titanic= pd.read_csv('C:/Users/welcome/Desktop/ML/titanic.csv')

In [4]:
titanic.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [5]:
import numpy as np

In [6]:
titanic_num=titanic.select_dtypes(include=[np.number])
titanic_cat=titanic.select_dtypes(include=[object])

In [7]:
titanic_num.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500

In [8]:
titanic_cat.head(3)

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S

#  cleaning Numerical Variable

In [9]:
titanic_num.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Age            177
SibSp            0
Parch            0
Fare             0
dtype: int64

In [10]:
(titanic_num.Age.isnull().sum())/len(titanic_num)

0.19865319865319866

In [11]:
titanic_num.Age.fillna(titanic_num.Age.mean(),inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\generic.py:6130: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._update_inplace(new_data)

# cleaning categorical variables

In [12]:
titanic_cat.isnull().sum()

Name          0
Sex           0
Ticket        0
Cabin       687
Embarked      2
dtype: int64

In [13]:
(titanic_cat.Cabin.isnull().sum())/len(titanic_cat)

0.7710437710437711

In [14]:
titanic_cat.Cabin.fillna(titanic_cat.Cabin.value_counts().idxmax(),inplace=True)

In [15]:
titanic_cat.Embarked.fillna(titanic_cat.Embarked.value_counts().idxmax(),inplace=True)

In [16]:
titanic_cat.head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,B96 B98,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,B96 B98,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,B96 B98,S

In [17]:
from sklearn.preprocessing import LabelEncoder

In [18]:
le = LabelEncoder()

In [19]:
titanic_cat = titanic_cat.apply(le.fit_transform)

In [20]:
titanic_final = pd.concat([titanic_num,titanic_cat],axis=1)

In [21]:
titanic_final.head()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Name,Sex,Ticket,Cabin,Embarked
0,1,0,3,22.0,1,0,7.2500,108,1,523,47,2
1,2,1,1,38.0,1,0,71.2833,190,0,596,81,0
2,3,1,3,26.0,0,0,7.9250,353,0,669,47,2
3,4,1,1,35.0,1,0,53.1000,272,0,49,55,2
4,5,0,3,35.0,0,0,8.0500,15,1,472,47,2

# TRAIN MODEL

In [24]:
from sklearn.model_selection import train_test_split

In [25]:
x=pd.DataFrame(titanic_final.drop(['PassengerId','Survived'],axis=1))

In [26]:
y=pd.DataFrame(titanic['Survived'])

In [27]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.33, random_state=0)

# Model selection

In [28]:
from sklearn.linear_model import LogisticRegression

In [29]:
lr=LogisticRegression()

In [30]:
lr.fit(x_train,y_train)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:433: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)
C:\ProgramData\Anaconda3\lib\site-packages\sklearn\utils\validation.py:761: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='warn',
          n_jobs=None, penalty='l2', random_state=None, solver='warn',
          tol=0.0001, verbose=0, warm_start=False)

In [31]:
pre=lr.predict(x_test)

In [32]:
from sklearn.metrics import classification_report

In [33]:
classification_report(y_test,pre)

'              precision    recall  f1-score   support\n\n           0       0.83      0.85      0.84       184\n           1       0.74      0.71      0.72       111\n\n   micro avg       0.80      0.80      0.80       295\n   macro avg       0.78      0.78      0.78       295\nweighted avg       0.80      0.80      0.80       295\n'

In [34]:
from sklearn.metrics import confusion_matrix

In [35]:
confusion_matrix(y_test,pre)

array([[156,  28],
       [ 32,  79]], dtype=int64)

# Accuracy

In [36]:
from sklearn.metrics import accuracy_score

In [37]:
accuracy_score(y_test,pre)

0.7966101694915254